@php
    use Illuminate\Support\Facades\Auth;
    $user = Auth::user();
    $rubleAccounts = $user->ruble_accounts ?? [];
@endphp
@extends('layouts.cabinet')
@section('title', $fund->name)
@section('head')
    <link rel="stylesheet" href="/css/modal.css">
@endsection
@section('scripts')
    <script src="/js/tabs.js"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/gsap/3.10.4/gsap.min.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/chart.js"></script>
    <script src="/js/chart.js"></script>
@endsection

@section('modal-windows')
    <div class="buy__dialog action-dialog" id="buyDialog1">
        <div class="buy__dialog-column">
            <h2 class="buy__dialog-title">
                Купить ПАИ
            </h2>
            <p class="buy__dialog-subtitle">
                Выберите реквизиты своего банковского счета
                для заполнения документов
            </p>
            <div class="buy__dialog-actions">
                <div class="g-select">
                    <div class="g-select__head" onclick="buy.openQueryAccount();">
                        <input type="text" id="accountName" required name="accountName" placeholder="Банковские счета"/>
                        <svg width="12" height="7" viewBox="0 0 12 7" fill="none" class="g-select__toggle"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M11.4428 9.92263e-05C11.298 0.00435584 11.1618 0.0639485 11.0618 0.168236L5.99855 5.23148L0.935309 0.168236C0.832086 0.0628845 0.691618 0.00329169 0.543701 0.00329169C0.322357 0.00329169 0.12336 0.138439 0.0403563 0.343821C-0.0437116 0.549202 0.00630337 0.78438 0.164862 0.938682L5.61333 6.38715C5.82616 6.59998 6.17094 6.59998 6.38377 6.38715L11.8322 0.938682C11.994 0.783316 12.0451 0.543882 11.9578 0.336372C11.8716 0.128862 11.6673 -0.00415739 11.4428 9.92263e-05Z"
                                fill="#B8B8B8"/>
                        </svg>
                    </div>
                    <div class="g-select__body" id="accountList" style="height: 0px;">
                        @foreach($rubleAccounts AS $account)
                            <p data='@php echo json_encode($account) @endphp' class="g-select__option"
                               onclick="buy.selectAccount(this)">
                                {{$account->bank_name." ".$account->payment_account}}
                            </p>
                        @endforeach
                    </div>
                </div>
                <div id="buttonStep1" style="padding-top: 20px; text-align: center;" onclick="buy.buyStep2();">
                    <a class="buy__dialog-btn send_code btn-green btn--rounded">Далее</a>
                </div>
            </div>
        </div>
    </div>
    <div class="buy__dialog action-dialog" id="buyDialog2">
        <div class="buy__dialog-column">
            <h2 class="buy__dialog-title">
                Документы <br> для подписания
            </h2>
            <p class="buy__dialog-subtitle">
                Для подписания документов на ваш телефон будет отправленно смс с кодом, вводя который вы подтверждаете
                указанные вами сведения и подписываете документы
            </p>
            <div class="buy__dialog-wrapper" style="text-align: left;">
                <a class="buy__dialog-link" id="requestFile" target="blank">Заявка на приобретение</a>
                <a class="buy__dialog-link" id="anketaFile" target="blank">Анкета Спецрега</a>
                <a class="buy__dialog-link" id="appFile" target="blank">Заявление на открытие лицевого счета</a>
            </div>
            <div class="buy__dialog-actions">
                <div class="checkbox-wrapper" onclick="buy.openButtonSendCode();">
                    <label class="checkbox-label" data-dashlane-label="true">
                        <input class="checkbox-input" type="checkbox" id="InfoByMoney">
                        <div class="checkbox-visible"></div>
                        <span>
                            <span>
                                Подтверждаю достоверность и подписание указанных мною сведений
                            </span>
                        </span>
                    </label>
                </div>
                <div id="message" style="color: red; text-align: center; padding-top: 20px;"></div>
            </div>
            <div class="buy__dialog-subtitle" id="sendCode" style="display: block">
                <a class="buy__dialog-btn btn-green btn--rounded" id="sendCodeButton" onclick="buy.sendCode();">
                    Получить код
                </a>
            </div>
            <div class="buy__dialog-subtitle" id="inputCode" style="display: none">
                <input placeholder="Полученный код" id="buy_code" name="buy_code"
                       class="buy_code buy__dialog-input input-default" value="" required>
                <p>
                    <a class="buy__dialog-btn btn-green btn--rounded" onclick="buy.signDocuments();">
                        Отправить
                    </a>
                </p>
            </div>
        </div>
    </div>
    <div class="buy__dialog action-dialog" id="buyDialog3">
        <div class="buy__dialog-column">
            <h2 class="buy__dialog-title">
                Оплатить ПАИ
            </h2>
            <p class="buy__dialog-subtitle">
                Выберите удобный способ оплаты
            </p>
            <div class="buy__dialog-payments">
            <span class="buy__dialog-payment" onclick="buy.openRekvisite();">
                <svg width="16" height="18" viewBox="0 0 16 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M2.39583 0C2.23454 0 2.10417 0.130667 2.10417 0.291667V4.95833H0.354167C0.192875 4.95833 0.0625 5.089 0.0625 5.25V13.125C0.0625 13.286 0.192875 13.4167 0.354167 13.4167H2.10417V17.2083C2.10417 17.3693 2.23454 17.5 2.39583 17.5H15.5208C15.6821 17.5 15.8125 17.3693 15.8125 17.2083C15.8125 17.2083 15.8105 4.38535 15.8102 4.38127C15.8117 4.30339 15.7842 4.22624 15.727 4.16878L11.6437 0.0854492C11.572 0.0136992 11.4876 0 11.3207 0H2.39583ZM2.6875 0.583333H11.1458V4.375C11.1458 4.536 11.2762 4.66667 11.4375 4.66667H15.2292V16.9167H2.6875V13.4167H8.22917C8.39046 13.4167 8.52083 13.286 8.52083 13.125V5.25C8.52083 5.089 8.39046 4.95833 8.22917 4.95833H2.6875V0.583333ZM11.7292 0.995768L14.8167 4.08333H11.7292V0.995768ZM0.645833 5.54167H7.9375V12.8333H0.645833V5.54167ZM9.97917 6.41667C9.90181 6.41667 9.82762 6.4474 9.77293 6.50209C9.71823 6.55679 9.6875 6.63098 9.6875 6.70833C9.6875 6.78569 9.71823 6.85988 9.77293 6.91457C9.82762 6.96927 9.90181 7 9.97917 7C10.0565 7 10.1307 6.96927 10.1854 6.91457C10.2401 6.85988 10.2708 6.78569 10.2708 6.70833C10.2708 6.63098 10.2401 6.55679 10.1854 6.50209C10.1307 6.4474 10.0565 6.41667 9.97917 6.41667ZM11.1458 6.41667C11.0685 6.41667 10.9943 6.4474 10.9396 6.50209C10.8849 6.55679 10.8542 6.63098 10.8542 6.70833C10.8542 6.78569 10.8849 6.85988 10.9396 6.91457C10.9943 6.96927 11.0685 7 11.1458 7C11.2232 7 11.2974 6.96927 11.3521 6.91457C11.4068 6.85988 11.4375 6.78569 11.4375 6.70833C11.4375 6.63098 11.4068 6.55679 11.3521 6.50209C11.2974 6.4474 11.2232 6.41667 11.1458 6.41667ZM12.3125 6.41667C12.2351 6.41667 12.161 6.4474 12.1063 6.50209C12.0516 6.55679 12.0208 6.63098 12.0208 6.70833C12.0208 6.78569 12.0516 6.85988 12.1063 6.91457C12.161 6.96927 12.2351 7 12.3125 7C12.3899 7 12.464 6.96927 12.5187 6.91457C12.5734 6.85988 12.6042 6.78569 12.6042 6.70833C12.6042 6.63098 12.5734 6.55679 12.5187 6.50209C12.464 6.4474 12.3899 6.41667 12.3125 6.41667ZM13.4792 6.41667C13.4018 6.41667 13.3276 6.4474 13.2729 6.50209C13.2182 6.55679 13.1875 6.63098 13.1875 6.70833C13.1875 6.78569 13.2182 6.85988 13.2729 6.91457C13.3276 6.96927 13.4018 7 13.4792 7C13.5565 7 13.6307 6.96927 13.6854 6.91457C13.7401 6.85988 13.7708 6.78569 13.7708 6.70833C13.7708 6.63098 13.7401 6.55679 13.6854 6.50209C13.6307 6.4474 13.5565 6.41667 13.4792 6.41667ZM1.6228 7.08887L2.60661 11.2861H3.59383L4.31274 8.059L5.03166 11.2861H5.97673L6.96053 7.08887H6.13965L5.4908 10.1377L4.77189 7.08887H3.8536L3.11247 10.2317L2.44368 7.08887H1.6228ZM9.97917 8.16667C9.90181 8.16667 9.82762 8.1974 9.77293 8.25209C9.71823 8.30679 9.6875 8.38098 9.6875 8.45833C9.6875 8.53569 9.71823 8.60988 9.77293 8.66457C9.82762 8.71927 9.90181 8.75 9.97917 8.75C10.0565 8.75 10.1307 8.71927 10.1854 8.66457C10.2401 8.60988 10.2708 8.53569 10.2708 8.45833C10.2708 8.38098 10.2401 8.30679 10.1854 8.25209C10.1307 8.1974 10.0565 8.16667 9.97917 8.16667ZM11.1458 8.16667C11.0685 8.16667 10.9943 8.1974 10.9396 8.25209C10.8849 8.30679 10.8542 8.38098 10.8542 8.45833C10.8542 8.53569 10.8849 8.60988 10.9396 8.66457C10.9943 8.71927 11.0685 8.75 11.1458 8.75C11.2232 8.75 11.2974 8.71927 11.3521 8.66457C11.4068 8.60988 11.4375 8.53569 11.4375 8.45833C11.4375 8.38098 11.4068 8.30679 11.3521 8.25209C11.2974 8.1974 11.2232 8.16667 11.1458 8.16667ZM12.3125 8.16667C12.2351 8.16667 12.161 8.1974 12.1063 8.25209C12.0516 8.30679 12.0208 8.38098 12.0208 8.45833C12.0208 8.53569 12.0516 8.60988 12.1063 8.66457C12.161 8.71927 12.2351 8.75 12.3125 8.75C12.3899 8.75 12.464 8.71927 12.5187 8.66457C12.5734 8.60988 12.6042 8.53569 12.6042 8.45833C12.6042 8.38098 12.5734 8.30679 12.5187 8.25209C12.464 8.1974 12.3899 8.16667 12.3125 8.16667ZM13.4792 8.16667C13.4018 8.16667 13.3276 8.1974 13.2729 8.25209C13.2182 8.30679 13.1875 8.38098 13.1875 8.45833C13.1875 8.53569 13.2182 8.60988 13.2729 8.66457C13.3276 8.71927 13.4018 8.75 13.4792 8.75C13.5565 8.75 13.6307 8.71927 13.6854 8.66457C13.7401 8.60988 13.7708 8.53569 13.7708 8.45833C13.7708 8.38098 13.7401 8.30679 13.6854 8.25209C13.6307 8.1974 13.5565 8.16667 13.4792 8.16667ZM9.97917 9.91667C9.90181 9.91667 9.82762 9.9474 9.77293 10.0021C9.71823 10.0568 9.6875 10.131 9.6875 10.2083C9.6875 10.2857 9.71823 10.3599 9.77293 10.4146C9.82762 10.4693 9.90181 10.5 9.97917 10.5C10.0565 10.5 10.1307 10.4693 10.1854 10.4146C10.2401 10.3599 10.2708 10.2857 10.2708 10.2083C10.2708 10.131 10.2401 10.0568 10.1854 10.0021C10.1307 9.9474 10.0565 9.91667 9.97917 9.91667ZM11.1458 9.91667C11.0685 9.91667 10.9943 9.9474 10.9396 10.0021C10.8849 10.0568 10.8542 10.131 10.8542 10.2083C10.8542 10.2857 10.8849 10.3599 10.9396 10.4146C10.9943 10.4693 11.0685 10.5 11.1458 10.5C11.2232 10.5 11.2974 10.4693 11.3521 10.4146C11.4068 10.3599 11.4375 10.2857 11.4375 10.2083C11.4375 10.131 11.4068 10.0568 11.3521 10.0021C11.2974 9.9474 11.2232 9.91667 11.1458 9.91667ZM12.3125 9.91667C12.2351 9.91667 12.161 9.9474 12.1063 10.0021C12.0516 10.0568 12.0208 10.131 12.0208 10.2083C12.0208 10.2857 12.0516 10.3599 12.1063 10.4146C12.161 10.4693 12.2351 10.5 12.3125 10.5C12.3899 10.5 12.464 10.4693 12.5187 10.4146C12.5734 10.3599 12.6042 10.2857 12.6042 10.2083C12.6042 10.131 12.5734 10.0568 12.5187 10.0021C12.464 9.9474 12.3899 9.91667 12.3125 9.91667ZM13.4792 9.91667C13.4018 9.91667 13.3276 9.9474 13.2729 10.0021C13.2182 10.0568 13.1875 10.131 13.1875 10.2083C13.1875 10.2857 13.2182 10.3599 13.2729 10.4146C13.3276 10.4693 13.4018 10.5 13.4792 10.5C13.5565 10.5 13.6307 10.4693 13.6854 10.4146C13.7401 10.3599 13.7708 10.2857 13.7708 10.2083C13.7708 10.131 13.7401 10.0568 13.6854 10.0021C13.6307 9.9474 13.5565 9.91667 13.4792 9.91667ZM9.97917 11.6667C9.90181 11.6667 9.82762 11.6974 9.77293 11.7521C9.71823 11.8068 9.6875 11.881 9.6875 11.9583C9.6875 12.0357 9.71823 12.1099 9.77293 12.1646C9.82762 12.2193 9.90181 12.25 9.97917 12.25C10.0565 12.25 10.1307 12.2193 10.1854 12.1646C10.2401 12.1099 10.2708 12.0357 10.2708 11.9583C10.2708 11.881 10.2401 11.8068 10.1854 11.7521C10.1307 11.6974 10.0565 11.6667 9.97917 11.6667ZM11.1458 11.6667C11.0685 11.6667 10.9943 11.6974 10.9396 11.7521C10.8849 11.8068 10.8542 11.881 10.8542 11.9583C10.8542 12.0357 10.8849 12.1099 10.9396 12.1646C10.9943 12.2193 11.0685 12.25 11.1458 12.25C11.2232 12.25 11.2974 12.2193 11.3521 12.1646C11.4068 12.1099 11.4375 12.0357 11.4375 11.9583C11.4375 11.881 11.4068 11.8068 11.3521 11.7521C11.2974 11.6974 11.2232 11.6667 11.1458 11.6667ZM12.3125 11.6667C12.2351 11.6667 12.161 11.6974 12.1063 11.7521C12.0516 11.8068 12.0208 11.881 12.0208 11.9583C12.0208 12.0357 12.0516 12.1099 12.1063 12.1646C12.161 12.2193 12.2351 12.25 12.3125 12.25C12.3899 12.25 12.464 12.2193 12.5187 12.1646C12.5734 12.1099 12.6042 12.0357 12.6042 11.9583C12.6042 11.881 12.5734 11.8068 12.5187 11.7521C12.464 11.6974 12.3899 11.6667 12.3125 11.6667ZM13.4792 11.6667C13.4018 11.6667 13.3276 11.6974 13.2729 11.7521C13.2182 11.8068 13.1875 11.881 13.1875 11.9583C13.1875 12.0357 13.2182 12.1099 13.2729 12.1646C13.3276 12.2193 13.4018 12.25 13.4792 12.25C13.5565 12.25 13.6307 12.2193 13.6854 12.1646C13.7401 12.1099 13.7708 12.0357 13.7708 11.9583C13.7708 11.881 13.7401 11.8068 13.6854 11.7521C13.6307 11.6974 13.5565 11.6667 13.4792 11.6667Z"
                        fill="#B8B8B8"/>
                </svg>
                <span id="rekvizitText" style="color: #909090;">
                    По реквизитам
                </span>
            </span>
                <span class="buy__dialog-payment" onclick="buy.openQrCode();">
                <svg class="g-select__append-before" width="16" height="16" viewBox="0 0 16 16" fill="none"
                     xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M1.8125 0C0.885254 0 0.125 0.760254 0.125 1.6875V3.9375C0.125 4.86475 0.885254 5.625 1.8125 5.625H2.375V6.75H3.5V5.625H4.0625C4.98975 5.625 5.75 4.86475 5.75 3.9375V1.6875C5.75 0.760254 4.98975 0 4.0625 0H1.8125ZM3.5 6.75V7.875H4.625V6.75H3.5ZM3.5 7.875H2.375V9H3.5V7.875ZM2.375 7.875V6.75H1.25V7.875H2.375ZM11.9375 0C11.0103 0 10.25 0.760254 10.25 1.6875V3.9375C10.25 4.86475 11.0103 5.625 11.9375 5.625H12.5V6.75H13.625V5.625H14.1875C15.1147 5.625 15.875 4.86475 15.875 3.9375V1.6875C15.875 0.760254 15.1147 0 14.1875 0H11.9375ZM13.625 6.75V7.875H14.75V6.75H13.625ZM13.625 7.875H12.5V9H13.625V7.875ZM13.625 9V10.125H14.75V9H13.625ZM13.625 10.125H12.5V11.25H13.625V10.125ZM12.5 10.125V9H11.375V10.125H12.5ZM1.8125 1.125H4.0625C4.37891 1.125 4.625 1.37109 4.625 1.6875V3.9375C4.625 4.25391 4.37891 4.5 4.0625 4.5H1.8125C1.49609 4.5 1.25 4.25391 1.25 3.9375V1.6875C1.25 1.37109 1.49609 1.125 1.8125 1.125ZM8 1.125V2.25H6.875V3.375H8V4.5H9.125V1.125H8ZM11.9375 1.125H14.1875C14.5039 1.125 14.75 1.37109 14.75 1.6875V3.9375C14.75 4.25391 14.5039 4.5 14.1875 4.5H11.9375C11.6211 4.5 11.375 4.25391 11.375 3.9375V1.6875C11.375 1.37109 11.6211 1.125 11.9375 1.125ZM2.375 2.25V3.375H3.5V2.25H2.375ZM12.5 2.25V3.375H13.625V2.25H12.5ZM5.75 5.625V6.75H9.125V7.875H10.25V5.625H5.75ZM6.875 7.875V9H5.75V10.125H10.25V9H8V7.875H6.875ZM1.8125 10.125C0.885254 10.125 0.125 10.8853 0.125 11.8125V14.0625C0.125 14.9897 0.885254 15.75 1.8125 15.75H4.0625C4.98975 15.75 5.75 14.9897 5.75 14.0625V11.8125C5.75 10.8853 4.98975 10.125 4.0625 10.125H1.8125ZM1.8125 11.25H4.0625C4.37891 11.25 4.625 11.4961 4.625 11.8125V14.0625C4.625 14.3789 4.37891 14.625 4.0625 14.625H1.8125C1.49609 14.625 1.25 14.3789 1.25 14.0625V11.8125C1.25 11.4961 1.49609 11.25 1.8125 11.25ZM6.875 11.25V14.625H8V11.25H6.875ZM2.375 12.375V13.5H3.5V12.375H2.375ZM10.25 12.375V13.5H11.375V12.375H10.25ZM11.375 13.5V14.625H12.5V13.5H11.375ZM12.5 13.5H13.625V12.375H12.5V13.5ZM13.625 13.5V14.625H14.75V13.5H13.625Z"
                        fill="#B8B8B8"/>
                </svg>
                <span id="qrText">
                    Через QR-код
                </span>
                    <!--
                    <svg width="12" height="7" viewBox="0 0 12 7" fill="none" class="g-select__toggle" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.4428 9.92263e-05C11.298 0.00435584 11.1618 0.0639485 11.0618 0.168236L5.99855 5.23148L0.935309 0.168236C0.832086 0.0628845 0.691618 0.00329169 0.543701 0.00329169C0.322357 0.00329169 0.12336 0.138439 0.0403563 0.343821C-0.0437116 0.549202 0.00630337 0.78438 0.164862 0.938682L5.61333 6.38715C5.82616 6.59998 6.17094 6.59998 6.38377 6.38715L11.8322 0.938682C11.994 0.783316 12.0451 0.543882 11.9578 0.336372C11.8716 0.128862 11.6673 -0.00415739 11.4428 9.92263e-05Z" fill="#B8B8B8"/>
                    </svg>
                    -->
            </span>
            </div>
            <div id="rekvisite" class="buy__dialog-subtitle" style="display: none; text-align: left;">
                <div>
                    Получатель : {{$company_details['company_full_name']}}
                </div>
                <div>
                    ИНН : {{$company_details['inn']}}
                </div>
                <div>
                    КПП : {{$company_details['kpp']}}
                </div>
                <div>
                    Расчетный счет : {{$company_details['pya_account']}}
                </div>
                <div>
                    Банк : {{$company_details['bank_name']}}
                </div>
                <div>
                    БИК : {{$company_details['bic']}}
                </div>
                <div>
                    Кор/сч : {{$company_details['cor_account']}}
                </div>
                <div style="padding-top: 20px;">
                    <a target="_blank" href="{{$company_details['pdf']}}" id="link-requsite">Скачать реквизиты для оплаты</a>
                </div>
            </div>
            <div id='qr-code' style='text-align: center;'>
                <p class="buy__dialog-info">
                    Отсканируйте QR-код в приложении вашего банка и введите сумму для покупки ПАЁВ. Средства будут
                    зачисленных
                    в течение трёх рабочих дней и купленные ПАИ отобразятся в вашем личном кабинете
                </p>
                <img src="{{$qrCode->render(false,['imageBase64'=>true])}}">
            </div>
            <a class="buy__dialog-btn btn-green btn--rounded" onclick="buy.endStep();">
                <span>Готово</span>
            </a>
        </div>
    </div>
    <div class="buy__dialog action-dialog" id="buyDialog4">
        <div class="buy__dialog-column">
            <div class="buy__dialog-exit dialog__exit"></div>
            <h2 class="buy__dialog-title" onclick="buy.closeActivWindow();">
                Готово
            </h2>
            <p class="buy__dialog-subtitle">
                Ваша заявка на приобретение ПАЁВ была оформлена, данный Фонд и количество ПАЁВ отобразятся в вашем
                личном кабинете
            </p>
        </div>
    </div>
@endsection

@section('content')
    <div class="content-body">
        <script src="/js/drawUpShares.js"></script>
        <script>
            @php
                $js_accounts = json_encode($rubleAccounts);
                $js_user = json_encode($user);
                $js_fund = json_encode($fund);
                echo '
                var buy = new drawUpShares('.$js_accounts.', '. $js_fund.');
                var user = '.$js_user.';
                ';
            @endphp
        </script>
        <div class="row">
            <div class="breadcrumbs">
                <div class="breadcrumbs-item">
                    <a href="/cabinet">Личный кабинет</a>
                </div>
                <div class="separator">|</div>
                <div class="breadcrumbs-item">
                    <a href="/funds">Все фонды</a>
                </div>
                <div class="separator">|</div>
                <div class="breadcrumbs-item">{{$fund->name}}</div>
            </div>
        </div>
        <div class="row-line fond-type-line single-fond-page">
                <span class="fond-type">
                    {{$fund->qualification_text}}
                </span>
            <span class="info-icon">
                    <svg width="8" height="8" viewBox="0 0 8 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M4 0C3.20888 0 2.43552 0.234596 1.77772 0.674121C1.11992 1.11365 0.607234 1.73836 0.304484 2.46927C0.00173315 3.20017 -0.0774802 4.00444 0.0768607 4.78036C0.231201 5.55628 0.612165 6.26901 1.17157 6.82842C1.73098 7.38783 2.44372 7.7688 3.21964 7.92314C3.99556 8.07748 4.79983 7.99827 5.53073 7.69551C6.26164 7.39276 6.88635 6.88007 7.32588 6.22228C7.7654 5.56448 8 4.79112 8 4C7.99875 2.93952 7.57692 1.92283 6.82704 1.17295C6.07717 0.42308 5.06048 0.00125108 4 0ZM4 7.27272C3.35272 7.27272 2.71997 7.08078 2.18177 6.72117C1.64357 6.36156 1.2241 5.85043 0.976396 5.25242C0.728691 4.6544 0.66388 3.99637 0.790159 3.36152C0.916438 2.72667 1.22813 2.14353 1.68583 1.68583C2.14353 1.22813 2.72668 0.916436 3.36152 0.790157C3.99637 0.663878 4.65441 0.728689 5.25242 0.976394C5.85043 1.2241 6.36156 1.64357 6.72117 2.18177C7.08079 2.71997 7.27273 3.35271 7.27273 4C7.27167 4.86765 6.92652 5.69947 6.313 6.313C5.69947 6.92652 4.86766 7.27167 4 7.27272ZM4.36364 2.54545H3.63636V1.81818H4.36364V2.54545ZM4.36364 6.18182H3.63636V3.27273H4.36364V6.18182Z"
                            fill="#2D3A2E"/>
                    </svg>
                    <div class="icon-description">
                        {{$fund->destiny}}
                    </div>
                </span>
        </div>
        <div class="row m-0">
            <h1 class="main-heading single-fond-heading">{{$fund->name}}</h1>
        </div>
        <div class="fond-info">
            <p class="fond-info-p">
                {{$fund->rules}}
            </p>
            <p class="fond-info-p">
                Инвестиционная политика Фонда: {{$fund->policy}}
            </p>
        </div>
        <div class="row m-0">
            <div class="row m-0 actions">
                <a href="/funds" class="action-link">
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M7.2834 0C10.9862 0 14 3.01381 14 6.7166C14 10.4194 10.9862 13.4332 7.2834 13.4332C5.85337 13.4332 4.53145 12.975 3.44738 12.2121C3.3259 12.1267 3.24331 11.9966 3.21779 11.8503C3.19226 11.704 3.22589 11.5536 3.31128 11.4321C3.39666 11.3106 3.52681 11.228 3.67309 11.2025C3.81936 11.177 3.96979 11.2106 4.09127 11.296C4.99867 11.9346 6.09172 12.3138 7.2834 12.3138C10.3812 12.3138 12.8806 9.81437 12.8806 6.7166C12.8806 3.61883 10.3812 1.11943 7.2834 1.11943C6.09172 1.11943 4.99867 1.4986 4.09127 2.1372C4.03112 2.17948 3.96323 2.20949 3.89148 2.22553C3.81973 2.24158 3.74551 2.24333 3.67309 2.23069C3.60066 2.21805 3.53143 2.19127 3.46935 2.15188C3.40727 2.11248 3.35355 2.06125 3.31128 2.0011C3.269 1.94094 3.23898 1.87305 3.22294 1.8013C3.2069 1.72955 3.20515 1.65534 3.21779 1.58291C3.23042 1.51048 3.2572 1.44125 3.2966 1.37917C3.33599 1.31709 3.38723 1.26338 3.44738 1.2211C4.53145 0.45817 5.85337 0 7.2834 0ZM2.81114 3.91255C2.92249 3.91258 3.03129 3.94581 3.12365 4.00801C3.21601 4.0702 3.28772 4.15852 3.32962 4.26168C3.37152 4.36485 3.3817 4.47816 3.35886 4.58714C3.33602 4.69612 3.2812 4.79581 3.20141 4.87347L1.918 6.15688H7.84312C7.91729 6.15583 7.99093 6.16953 8.05975 6.19719C8.12858 6.22485 8.19123 6.26591 8.24405 6.31799C8.29687 6.37007 8.33881 6.43212 8.36744 6.50055C8.39607 6.56898 8.41081 6.64242 8.41081 6.7166C8.41081 6.79077 8.39607 6.86421 8.36744 6.93264C8.33881 7.00107 8.29687 7.06313 8.24405 7.1152C8.19123 7.16728 8.12858 7.20834 8.05975 7.236C7.99093 7.26366 7.91729 7.27736 7.84312 7.27631H1.918L3.20141 8.55972C3.25513 8.6113 3.29802 8.67307 3.32756 8.74143C3.35711 8.80979 3.37271 8.88336 3.37347 8.95782C3.37423 9.03229 3.36012 9.10615 3.33197 9.1751C3.30383 9.24404 3.26221 9.30668 3.20955 9.35934C3.15689 9.41199 3.09426 9.45362 3.02531 9.48176C2.95637 9.50991 2.8825 9.52402 2.80803 9.52326C2.73357 9.5225 2.66 9.50689 2.59164 9.47735C2.52329 9.4478 2.46151 9.40492 2.40994 9.3512L0.220264 7.16153C0.151692 7.10922 0.0961342 7.04177 0.0579262 6.96445C0.0197182 6.88713 -0.000105858 6.80202 -9.53674e-07 6.71578C0.000104904 6.62953 0.0201397 6.54448 0.0585365 6.46725C0.0969343 6.39002 0.152658 6.32271 0.221357 6.27057L2.40994 4.08199C2.4621 4.02838 2.52447 3.98576 2.59338 3.95665C2.66229 3.92755 2.73634 3.91255 2.81114 3.91255Z"
                            fill="#B8B8B8"/>
                    </svg>
                    <span>Вернуться к списку</span>
                </a>
                <a href="/report/growth/{{$fund->id}}" class="action-link">
                    <span>Отчетность</span>
                </a>
                <a href="/" class="fund-action-link action-link">
                    <span>Документы фонда</span>
                </a>
            </div>
        </div>
        <div class="row m-0 fund-btn-actions">
            <div class="row m-0 actions">
                <a class="fund-action-btn btn-buy btn-green" onclick="buy.buyStep1();">
                    <span>Купить ПАИ</span>
                </a>
                <a class="fund-action-btn btn-sale btn-green btn--outline">
                    <span>Продать ПАИ</span>
                </a>

            </div>
        </div>
        <div class="row row-column">
            <h2 class="sub-headinf">Динамика стоимости пая и чистых активов</h2>
            <div class="chart-descr">
                <div class="chart-descr-item">
                    <div class="color green"></div>
                    <span>Cтоимость пая</span>
                </div>
                <div class="chart-descr-item">
                    <div class="color gray"></div>
                    <span>Cтоимость чистых активов</span>
                </div>
            </div>
            <div class="period">
                <div class="period-start">{{date('d.m.Y', strtotime((string)$fund->created_at))}}</div>
                —
                <div class="period-end">{{date('d.m.Y', strtotime((string)$fund->updated_at))}}</div>
            </div>
            <div class="grows-count">
                @php
                    $growth = $fund->growth_calculation_percent();
                @endphp
                @if($growth > 0)
                    ↑
                @else
                    ↓
                @endif
                {{$fund->growth_calculation_sum()}} RUB ({{$growth}}%)
            </div>
            <div class="chart-wrapper">
                <canvas id="myChart"></canvas>
                <div class="chart-legend" id="legend-container">
                    <!--
                        data-labels: подписи для графика снизу начинать передаваемую строку с запятой
                        data-points1: точки для серого графика
                        data-points2: точки для зеленого графика
                        data-index: индексы самих графиков, 0,1 график для кнопки 3мес и так далее по порядку
                        Все атрибуты обязательные!
                        Передавать строкой разделенной запятыми, иначе не будет работать!
                    -->
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="0,1" class="btn-ctrl-chart">1 мес
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="2,3" class="btn-ctrl-chart">3 мес
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="4,5" class="btn-ctrl-chart">6 мес
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="6,7" class="btn-ctrl-chart">1 год
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="8,9" class="btn-ctrl-chart">3 года
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="10,11" class="btn-ctrl-chart">5 лет
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="12,13"
                        class="btn-ctrl-chart">
                        с начала фонда
                    </button>
                    <button
                        data-labels=",01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 100, 200, 300, 400, 500, 350, 200, 400, 500, 500, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="14,15"
                        class="btn-ctrl-chart">
                        с начала года
                    </button>
                    <button
                        data-labels="' ',01.02.2010, 01.03.2020,01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020, 01.02.2010, 01.03.2020,01.02.2010, 01.03.2020"
                        data-points1="0, 120, 100, 340, 410, 300, 250, 700, 600, 450, 350, 600"
                        data-points2="100, 150, 250, 350, 450, 525"
                        data-index="16,17"
                        class="btn-ctrl-chart">
                        произвольный
                    </button>
                </div>
            </div>
        </div>
@stop
