<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta id="csrf" name="csrf-token" content="{{ csrf_token() }}">
    <link rel="shortcut icon" href="/img/logo.svg" type="image/x-icon">
    <link rel="stylesheet" href="/css/lk.css">
    <link rel="stylesheet" href="/css/other-pages.css">
    @yield('head')
    <title>@yield('title')</title>
</head>
<body>
<div class="content-wrapper">
    @php
        $user = \Illuminate\Support\Facades\Auth::user();
    @endphp
    <div class="sidebar">
        <div class="sidebar-content">
            <div class="logo">
                <a class="logo-link" href="{{route('cabinet')}}">
                    <img src="/img/logo.svg" alt="">
                </a>
                <div class="btn-close">
                    <svg width="22" height="21" viewBox="0 0 22 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <rect width="28.4611" height="1.23744"
                              transform="matrix(-0.707107 -0.707107 -0.707107 0.707107 21.0364 20.1249)"
                              fill="#2D3A2E"/>
                        <rect y="20.1249" width="28.4611" height="1.23744" transform="rotate(-45 0 20.1249)"
                              fill="#2D3A2E"/>
                    </svg>
                </div>
            </div>
            <nav class="sidebar-nav">
                <ul class="sidebar-nav__list">
                    <li class="sidebar-nav__item icon">
                        <a class="sidebar-nav__link" href="{{route('cabinet')}}">
                            <svg width="13" height="15" viewBox="0 0 13 15" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M6.50002 0C4.59573 0 3.03849 1.21244 3.03849 3.46154C3.03849 4.96695 3.73936 6.52644 4.76925 7.39183V8.1851C4.76925 8.53215 4.53488 8.82963 4.24642 8.88822C1.99732 9.58008 0.15387 11.0697 0.15387 11.9351V12.9808C0.15387 14.076 2.97989 15 6.50002 15C10.0202 15 12.8462 14.076 12.8462 12.9808V11.9351C12.8462 11.1283 11.0613 9.58008 8.75363 8.88822C8.46517 8.82963 8.23079 8.47356 8.23079 8.1851V7.39183C9.26069 6.52644 9.96156 4.96695 9.96156 3.46154C9.96156 1.21244 8.40432 0 6.50002 0Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>{{$user->lastname}} {{$user->name}} {{$user->patronymic}}</span>
                        </a>
                    </li>
                    <li class="sidebar-nav__item icon">
                        <a class="sidebar-nav__link" href="{{route('profile')}}">
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M12.7083 0H2.29167C1.02833 0 0 1.02833 0 2.29167V12.7083C0 13.9717 1.02833 15 2.29167 15H12.7083C13.9717 15 15 13.9717 15 12.7083V2.29167C15 1.02833 13.9717 0 12.7083 0ZM7.5 2.91667C8.65042 2.91667 9.58333 3.84958 9.58333 5C9.58333 6.15042 8.65042 7.08333 7.5 7.08333C6.34958 7.08333 5.41667 6.15042 5.41667 5C5.41667 3.84958 6.34958 2.91667 7.5 2.91667ZM11.25 9.39083C11.25 10.5821 9.73042 11.6667 7.5 11.6667C5.26958 11.6667 3.75 10.5821 3.75 9.39083V9.10917C3.75 8.68083 4.0975 8.33333 4.52583 8.33333H10.4742C10.9025 8.33333 11.25 8.68083 11.25 9.10917V9.39083Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>Мой профиль</span>
                        </a>
                    </li>
                    <!--
                    <li class="sidebar-nav__item icon">
                        <a class="sidebar-nav__link" href="/">
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M1.6875 0C0.757125 0 0 0.757125 0 1.6875V11.4375C0 12.3679 0.757125 13.125 1.6875 13.125H11.4375C12.3679 13.125 13.125 12.3679 13.125 11.4375V1.6875C13.125 0.757125 12.3679 0 11.4375 0H1.6875ZM13.875 1.97827V11.8125C13.875 12.9495 12.9499 13.875 11.8125 13.875H1.97827C2.21115 14.5282 2.83013 15 3.5625 15H11.8125C13.5701 15 15 13.5701 15 11.8125V3.5625C15 2.83013 14.5282 2.21152 13.875 1.97827ZM9.18677 4.125C9.33067 4.125 9.4746 4.17992 9.58447 4.28979C9.80422 4.50954 9.80458 4.86546 9.58521 5.08521L6.21021 8.46021C6.10033 8.57008 5.9565 8.625 5.8125 8.625C5.6685 8.625 5.52467 8.57008 5.41479 8.46021L3.91479 6.96021C3.69504 6.74046 3.69504 6.38454 3.91479 6.16479C4.13454 5.94504 4.49046 5.94504 4.71021 6.16479L5.81177 7.26709L8.78906 4.28979C8.89894 4.17992 9.04286 4.125 9.18677 4.125Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>Квалицикация</span>
                        </a>
                    </li>
                    -->
                    <li class="sidebar-nav__item icon">
                        <a class="sidebar-nav__link" href="{{route('documents')}}">
                            <svg width="15" height="19" viewBox="0 0 15 19" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M1.875 0C0.84375 0 0 0.84375 0 1.875V16.875C0 17.9063 0.84375 18.75 1.875 18.75H13.125C14.1562 18.75 15 17.9063 15 16.875V5.625L9.375 0H1.875ZM8.4375 1.40625L13.5938 6.5625H8.4375V1.40625ZM6.0498 8.44849C6.59895 8.44849 7.15039 8.66262 7.57507 9.09668C8.18632 9.72012 8.44969 10.6374 8.4375 11.2683C8.42156 12.128 7.94993 13.0828 7.19055 13.905C7.34805 14.0053 7.49438 14.0625 7.61719 14.0625C7.97719 14.0625 8.21874 13.8087 8.64624 13.2715C9.03155 12.7887 9.51188 12.1875 10.3125 12.1875C10.7288 12.1875 11.0971 12.4628 11.2134 12.8632C11.3259 13.2363 11.7291 14.0625 12.1875 14.0625V15.9375C11.1816 15.9375 10.4526 15.3058 9.98291 14.6008C9.50854 15.1849 8.80781 15.9375 7.61719 15.9375C6.94781 15.9375 6.28146 15.6143 5.69458 15.108C4.83489 15.6152 3.84188 15.9375 2.8125 15.9375V14.0625C3.39 14.0625 3.96667 13.8921 4.48792 13.6249C4.05292 12.8721 3.77714 12.0376 3.75183 11.283C3.72933 10.6417 3.92588 9.72882 4.54651 9.0857C4.95526 8.66288 5.50066 8.44849 6.0498 8.44849ZM6.05347 10.3125C6.00847 10.3125 5.9626 10.3182 5.89417 10.3894C5.73198 10.5572 5.61286 10.9199 5.62317 11.217C5.63817 11.6258 5.77411 12.0555 5.97473 12.453C6.33567 12.0264 6.55594 11.5851 6.5625 11.2317C6.56625 11.0348 6.4522 10.6289 6.23657 10.4095C6.14095 10.312 6.08159 10.3125 6.05347 10.3125Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>
                                Документы
                                @if($count = (count($user->getNoSignDocuments()) > 0))
                                    <div class="notifications-count">{{count($user->getNoSignDocuments())}}</div>
                                @endif
                            </span>
                        </a>
                    </li>

                    <li class="sidebar-nav__item icon">
                        <a class="sidebar-nav__link" href="{{route('omitted')}}">
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M1.6875 0C0.757125 0 0 0.757125 0 1.6875V11.4375C0 12.3679 0.757125 13.125 1.6875 13.125H11.4375C12.3679 13.125 13.125 12.3679 13.125 11.4375V1.6875C13.125 0.757125 12.3679 0 11.4375 0H1.6875ZM13.875 1.97827V11.8125C13.875 12.9495 12.9499 13.875 11.8125 13.875H1.97827C2.21115 14.5282 2.83013 15 3.5625 15H11.8125C13.5701 15 15 13.5701 15 11.8125V3.5625C15 2.83013 14.5282 2.21152 13.875 1.97827ZM9.18677 4.125C9.33067 4.125 9.4746 4.17992 9.58447 4.28979C9.80422 4.50954 9.80458 4.86546 9.58521 5.08521L6.21021 8.46021C6.10033 8.57008 5.9565 8.625 5.8125 8.625C5.6685 8.625 5.52467 8.57008 5.41479 8.46021L3.91479 6.96021C3.69504 6.74046 3.69504 6.38454 3.91479 6.16479C4.13454 5.94504 4.49046 5.94504 4.71021 6.16479L5.81177 7.26709L8.78906 4.28979C8.89894 4.17992 9.04286 4.125 9.18677 4.125Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>Инвестиционный комитет</span>
                        </a>
                    </li>
                </ul>
            </nav>
            <nav class="fond-nav">
                <h3 class="nav-heading">Ваши фонды</h3>
                <ul class="fond-list">
                    @foreach($user->funds as $fund)
                        <li class="fond-item">
                            <div class="fond-item__link" style="width: 100%">
                                <a href="/fund/{{$fund->fund->id}}">{{$fund->fund->name}}</a>
                                <svg style="margin:auto;" width="12" height="7" viewBox="0 0 12 7" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M11.4428 9.92263e-05C11.298 0.00435584 11.1618 0.0639485 11.0618 0.168236L5.99855 5.23148L0.935309 0.168236C0.832086 0.0628845 0.691618 0.00329169 0.543701 0.00329169C0.322357 0.00329169 0.12336 0.138439 0.0403563 0.343821C-0.0437116 0.549202 0.00630337 0.78438 0.164862 0.938682L5.61333 6.38715C5.82616 6.59998 6.17094 6.59998 6.38377 6.38715L11.8322 0.938682C11.994 0.783316 12.0451 0.543882 11.9578 0.336372C11.8716 0.128862 11.6673 -0.00415739 11.4428 9.92263e-05Z"
                                        fill="#2D3A2E"/>
                                </svg>
                            </div>
                            <ul class="reports-list">
                                <h3 class="nav-heading small">Отчеты</h3>
                                <li class="report-item">
                                    <a href="/inquiry/sca/{{$fund->fund->id}}" class="report-link">
                                        <div class="link-icon yellow"></div>
                                        <span>Справка СЧА</span>
                                    </a>
                                </li>
                                <li class="report-item">
                                    <a href="/report/growth/{{$fund->fund->id}}" class="report-link">
                                        <div class="link-icon blue"></div>
                                        <span>Отчёт о приросте</span>
                                    </a>
                                </li>
                            </ul>
                        </li>
                    @endforeach
                </ul>
            </nav>
            <div class="sidebar-controlls">
                <ul class="sidebar-controll__list">
                    <li class="sidebar-controll__item icon">
                        <div class="circle"></div>
                        <div class="shadow"></div>
                        <div id="notification-6" class="notification">
                            <div class="notification-row">
                                Если у вас возникнут вопросы или трудности, вы можете связаться с нами через раздел
                                «Поддержка»
                            </div>
                            <button class="next-step">
                                <span>Готово !</span>
                            </button>
                        </div>
                        <a class="sidebar-controll__link helpers" href="{{route('support')}}">
                            <svg class="svg-icon" width="15" height="16" viewBox="0 0 15 16" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M7.10526 0C3.61737 0 0.789474 2.82789 0.789474 6.31579V7.10526V7.81764C0.336546 8.24953 0 8.80511 0 9.47368C0 10.4542 0.677014 11.1812 1.53423 11.5368C2.56136 13.9919 4.61861 15.7895 7.10526 15.7895H8.68421C8.78883 15.791 8.89269 15.7716 8.98977 15.7326C9.08685 15.6936 9.17521 15.6357 9.24971 15.5622C9.32421 15.4888 9.38337 15.4012 9.42375 15.3047C9.46413 15.2082 9.48493 15.1046 9.48493 15C9.48493 14.8954 9.46413 14.7918 9.42375 14.6953C9.38337 14.5988 9.32421 14.5112 9.24971 14.4378C9.17521 14.3643 9.08685 14.3064 8.98977 14.2674C8.89269 14.2284 8.78883 14.209 8.68421 14.2105H7.10526C5.32228 14.2105 3.70339 12.868 2.8896 10.7473C2.83891 10.6152 2.75363 10.4991 2.64268 10.4112C2.53173 10.3233 2.39919 10.2668 2.25894 10.2477C1.87013 10.1942 1.57895 9.88036 1.57895 9.47368C1.57895 9.16974 1.73243 8.93129 1.97214 8.79369C2.09257 8.72451 2.19263 8.62479 2.2622 8.50458C2.33178 8.38438 2.36842 8.24795 2.36842 8.10907V7.89474V7.10526C2.36842 6.66947 2.72211 6.31579 3.15789 6.31579H11.0526C11.4884 6.31579 11.8421 6.66947 11.8421 7.10526V7.89474V11.0526H8.61482C8.53329 10.822 8.38234 10.6223 8.18272 10.4809C7.9831 10.3396 7.74461 10.2635 7.5 10.2632C7.18593 10.2632 6.88472 10.3879 6.66264 10.61C6.44055 10.8321 6.31579 11.1333 6.31579 11.4474C6.31619 11.7465 6.42977 12.0344 6.63371 12.2532C6.83765 12.472 7.11684 12.6055 7.41519 12.627C7.44336 12.63 7.47167 12.6316 7.5 12.6316H12.6316H13.4211C14.2895 12.6316 15 11.9211 15 11.0526V9.47368C15 8.60526 14.2895 7.89474 13.4211 7.89474V6.31579C13.4211 2.82789 10.5932 0 7.10526 0Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>Поддержка</span>
                        </a>
                    </li>
                    <li class="sidebar-controll__item icon">
                        <a class="sidebar-controll__link" href="{{route('logout')}}">
                            <svg width="16" height="15" viewBox="0 0 16 15" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M14.2083 0H2.54167C1.62083 0 0.875 0.745833 0.875 1.66667V13.3333C0.875 14.2542 1.62083 15 2.54167 15H14.2083C15.1292 15 15.875 14.2542 15.875 13.3333V1.66667C15.875 0.745833 15.1292 0 14.2083 0ZM14.7975 8.08917L12.0475 10.8392C11.885 11.0017 11.6717 11.0833 11.4583 11.0833C11.245 11.0833 11.0317 11.0017 10.8692 10.8392C10.5433 10.5133 10.5433 9.98667 10.8692 9.66083L12.1967 8.33333H5.875C5.41417 8.33333 5.04167 7.96083 5.04167 7.5C5.04167 7.03917 5.41417 6.66667 5.875 6.66667H12.1967L10.8692 5.33917C10.5433 5.01333 10.5433 4.48667 10.8692 4.16083C11.195 3.835 11.7217 3.835 12.0475 4.16083L14.7975 6.91083C15.1233 7.23667 15.1233 7.76333 14.7975 8.08917Z"
                                    fill="#B8B8B8"/>
                            </svg>
                            <span>Выход</span>
                        </a>
                    </li>
                </ul>
            </div>
        </div>
    </div>
    <div class="content-bar">
        <div class="shadow shadow-desktop"></div>
        <div id="notification-5" class="notification">
            <div class="notification-row">
                В боковом меню собраны
                все разделы вашего личного кабинета для быстрого и удобного доступа к вашим Фондам, документам и
                настройкам личного профиля
            </div>
            <button class="next-step">
                <span>Далее</span>
                <svg width="44" height="8" viewBox="0 0 44 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M43.3535 4.35355C43.5488 4.15829 43.5488 3.84171 43.3535 3.64645L40.1716 0.464466C39.9763 0.269204 39.6597 0.269204 39.4645 0.464466C39.2692 0.659728 39.2692 0.976311 39.4645 1.17157L42.2929 4L39.4645 6.82843C39.2692 7.02369 39.2692 7.34027 39.4645 7.53553C39.6597 7.7308 39.9763 7.7308 40.1716 7.53553L43.3535 4.35355ZM0 4.5H43V3.5H0V4.5Z"
                        fill="#A7CF43"/>
                </svg>
            </button>
        </div>

        <div class="header">
            <nav class="content-bar-nav">
                <ul class="content-bar__nav-list">
                    <li class="content-bar__nav-item icon">
                        <a href="{{route('funds')}}" class="content-bar__nav-link">
                            Все фонды
                        </a>
                    </li>
                    <li class="content-bar__nav-item icon">
                        <a href="{{route('news')}}" class="content-bar__nav-link">
                            Новости
                        </a>
                    </li>
                    <li class="content-bar__nav-item icon">
                        <a href="{{route('documents')}}" class="content-bar__nav-link">
                            Документы УК
                        </a>
                    </li>
                    <li class="content-bar__nav-item icon">
                        <a href="{{route('contacts')}}" class="content-bar__nav-link">
                            Контакты
                        </a>
                    </li>
                </ul>
                <div class="content-bar__nav-icons">
                    <div class="search icon">
                        <div class="shadow"></div>
                        <div class="circle"></div>
                        <div id="notification-3" class="notification">
                            <div class="notification-row">
                                Найти любую необходимую информацию о Фондах вы можете через Поиск
                            </div>
                            <button class="next-step">
                                <span>Далее</span>
                                <svg width="44" height="8" viewBox="0 0 44 8" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M43.3535 4.35355C43.5488 4.15829 43.5488 3.84171 43.3535 3.64645L40.1716 0.464466C39.9763 0.269204 39.6597 0.269204 39.4645 0.464466C39.2692 0.659728 39.2692 0.976311 39.4645 1.17157L42.2929 4L39.4645 6.82843C39.2692 7.02369 39.2692 7.34027 39.4645 7.53553C39.6597 7.7308 39.9763 7.7308 40.1716 7.53553L43.3535 4.35355ZM0 4.5H43V3.5H0V4.5Z"
                                        fill="#A7CF43"/>
                                </svg>
                            </button>
                        </div>
                        <div class="search-input">
                            <form method="post" action="{{route('search')}}">
                                @csrf
                                <input class="input-default" type="text" placeholder="Введите текст для поиска">
                                <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M9.92263e-05 0.557242C0.00435584 0.701967 0.0639485 0.838179 0.168236 0.938209L5.23148 6.00145L0.168236 11.0647C0.0628845 11.1679 0.00329169 11.3084 0.00329169 11.4563C0.00329169 11.6776 0.138439 11.8766 0.343821 11.9596C0.549202 12.0437 0.78438 11.9937 0.938682 11.8351L6.38715 6.38667C6.59998 6.17384 6.59998 5.82906 6.38715 5.61623L0.938682 0.167762C0.783316 0.00601101 0.543882 -0.0450687 0.336372 0.0421925C0.128862 0.128388 -0.00415739 0.332705 9.92263e-05 0.557242Z"
                                        fill="#B8B8B8"/>
                                </svg>
                            </form>
                        </div>
                        <svg class="svg-icon" width="18" height="18" viewBox="0 0 18 18" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path d="M18 16.2L16.2 18L10.8 12.6V10.8H12.6L18 16.2Z" fill="#B8B8B8"/>
                            <path
                                d="M6.3 12.6C2.79 12.6 0 9.81 0 6.3C0 2.79 2.79 0 6.3 0C9.81 0 12.6 2.79 12.6 6.3C12.6 9.81 9.81 12.6 6.3 12.6ZM6.3 1.8C3.78 1.8 1.8 3.78 1.8 6.3C1.8 8.82 3.78 10.8 6.3 10.8C8.82 10.8 10.8 8.82 10.8 6.3C10.8 3.78 8.82 1.8 6.3 1.8Z"
                                fill="#B8B8B8"/>
                            <path d="M9.56146 10.2612L10.1979 9.62492L12.425 11.8526L11.7885 12.4889L9.56146 10.2612Z"
                                  fill="#B8B8B8"/>
                        </svg>
                    </div>
                    <div class="notifications icon">
                        <div class="shadow"></div>
                        <div class="circle"></div>
                        <div id="notification-2" class="notification">
                            <div class="notification-row">
                                Здесь будут отображаться все уведомления вашего личного кабинета
                            </div>
                            <button class="next-step">
                                <span>Далее</span>
                                <svg width="44" height="8" viewBox="0 0 44 8" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M43.3535 4.35355C43.5488 4.15829 43.5488 3.84171 43.3535 3.64645L40.1716 0.464466C39.9763 0.269204 39.6597 0.269204 39.4645 0.464466C39.2692 0.659728 39.2692 0.976311 39.4645 1.17157L42.2929 4L39.4645 6.82843C39.2692 7.02369 39.2692 7.34027 39.4645 7.53553C39.6597 7.7308 39.9763 7.7308 40.1716 7.53553L43.3535 4.35355ZM0 4.5H43V3.5H0V4.5Z"
                                        fill="#A7CF43"/>
                                </svg>
                            </button>
                        </div>
                        <div class="notifications-block">
                            <ul class="notifications-list">
                                @foreach($user->notifications() as $notification)
                                    <li class="notification-item">
                                        {{$notification}}
                                    </li>
                                @endforeach
                            </ul>
                        </div>
                        @if(!$user->notifications())
                            <!-- Иконка если уведомлений нет -->
                            <svg width="15" height="19" viewBox="0 0 15 19" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M7.5 0C6.72375 0 6.09375 0.63 6.09375 1.40625V2.05811C3.66861 2.68321 1.875 4.8795 1.875 7.5V13.125L0 15V15.9375H5.87769C5.7126 16.2224 5.62545 16.5457 5.625 16.875C5.625 17.3723 5.82254 17.8492 6.17418 18.2008C6.52581 18.5525 7.00272 18.75 7.5 18.75C7.99728 18.75 8.47419 18.5525 8.82582 18.2008C9.17746 17.8492 9.375 17.3723 9.375 16.875C9.37399 16.5456 9.28621 16.2222 9.12048 15.9375H15V15L13.125 13.125V7.5C13.125 4.8795 11.3314 2.68321 8.90625 2.05811V1.40625C8.90625 0.63 8.27625 0 7.5 0ZM7.5 3.75C9.56812 3.75 11.25 5.43187 11.25 7.5V13.125V13.9014L11.4111 14.0625H3.58887L3.75 13.9014V13.125V7.5C3.75 5.43187 5.43187 3.75 7.5 3.75Z"
                                    fill="#B8B8B8"/>
                            </svg>
                        @else
                            <!-- Иконка если уведомления есть -->
                            <svg class="svg-icon" width="17" height="19" viewBox="0 0 17 19" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M7.5 0C6.72375 0 6.09375 0.63 6.09375 1.40625V2.05811C3.66861 2.68321 1.875 4.8795 1.875 7.5V13.125L0 15V15.9375H5.87769C5.7126 16.2224 5.62545 16.5457 5.625 16.875C5.625 17.3723 5.82254 17.8492 6.17418 18.2008C6.52581 18.5525 7.00272 18.75 7.5 18.75C7.99728 18.75 8.47419 18.5525 8.82582 18.2008C9.17746 17.8492 9.375 17.3723 9.375 16.875C9.37399 16.5456 9.28621 16.2222 9.12048 15.9375H15V15L13.125 13.125V7.5C13.125 4.8795 11.3314 2.68321 8.90625 2.05811V1.40625C8.90625 0.63 8.27625 0 7.5 0ZM7.5 3.75C9.56812 3.75 11.25 5.43187 11.25 7.5V13.125V13.9014L11.4111 14.0625H3.58887L3.75 13.9014V13.125V7.5C3.75 5.43187 5.43187 3.75 7.5 3.75Z"
                                    fill="#B8B8B8"/>
                                <circle cx="12.6139" cy="5.11366" r="3.38636" fill="#D74D3E" stroke="white"
                                        stroke-width="2"/>
                            </svg>
                        @endif
                    </div>
                    <div class="burger-btn icon">
                        <div class="shadow mobile-shadow"></div>
                        <div class="burger-circle circle"></div>
                        <svg class="svg-icon" width="23" height="21" viewBox="0 0 23 21" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <rect width="23" height="1" fill="#2D3A2E"/>
                            <rect y="10" width="23" height="1" fill="#2D3A2E"/>
                            <rect y="20" width="23" height="1" fill="#2D3A2E"/>
                        </svg>
                    </div>
                </div>
            </nav>
        </div>
        @yield('content')
        <div class="content-footer">
            <svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M11.4428 9.92263e-05C11.298 0.00435584 11.1618 0.0639485 11.0618 0.168236L5.99855 5.23148L0.935309 0.168236C0.832086 0.0628845 0.691618 0.00329169 0.543701 0.00329169C0.322357 0.00329169 0.12336 0.138439 0.0403563 0.343821C-0.0437116 0.549202 0.00630337 0.78438 0.164862 0.938682L5.61333 6.38715C5.82616 6.59998 6.17094 6.59998 6.38377 6.38715L11.8322 0.938682C11.994 0.783316 12.0451 0.543882 11.9578 0.336372C11.8716 0.128862 11.6673 -0.00415739 11.4428 9.92263e-05Z"
                    fill="#2D3A2E"/>
            </svg>
        </div>
        <div class="mobile-footer">
            © 2021 ООО УК «Гамма Групп». Все права защищены.
        </div>
    </div>
</div>
<div class="shadow shadow-1"></div>
<div id="notification-1" class="notification">
    <div class="notification-row">
        Добрый день! <br>
        <br>
        Мы обновили внешний вид Личного кабинета для инвесторов. Чтобы вам было удобней в нём ориентироваться, мы
        подготовили несколько подсказок по основным разделам
    </div>
    <button class="next-step">
        <span>Далее</span>
        <svg width="44" height="8" viewBox="0 0 44 8" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M43.3535 4.35355C43.5488 4.15829 43.5488 3.84171 43.3535 3.64645L40.1716 0.464466C39.9763 0.269204 39.6597 0.269204 39.4645 0.464466C39.2692 0.659728 39.2692 0.976311 39.4645 1.17157L42.2929 4L39.4645 6.82843C39.2692 7.02369 39.2692 7.34027 39.4645 7.53553C39.6597 7.7308 39.9763 7.7308 40.1716 7.53553L43.3535 4.35355ZM0 4.5H43V3.5H0V4.5Z"
                fill="#A7CF43"/>
        </svg>
    </button>
</div>
<svg width="3" height="13" viewBox="0 0 3 13" fill="none" xmlns="http://www.w3.org/2000/svg">
    <circle cx="1.5" cy="1.5" r="1.5" fill="#B8B8B8"/>
    <circle cx="1.5" cy="6.5" r="1.5" fill="#B8B8B8"/>
    <circle cx="1.5" cy="11.5" r="1.5" fill="#B8B8B8"/>
</svg>
<script src="https://cdnjs.cloudflare.com/ajax/libs/gsap/3.10.4/gsap.min.js"></script>
<script type="module" src="/js/index.js"></script>
<script src="/js/select.js">
    var user = {{json_encode($user)}};
</script>
@yield('script')
@yield('modal-windows')
</body>
</html>
